package mock

import "jitD/models"

var MockTestConsult []models.Test
var MockTestStress []models.Test

func init() {

	allChoice := [4]models.Choice{
		{
			Number: 1,
			Text:   "ไม่เคยเลย",
			Value:  0,
		},
		{
			Number: 2,
			Text:   "เป็นครั้งคราว",
			Value:  1,
		},
		{
			Number: 3,
			Text:   "เป็นบ่อย",
			Value:  2,
		}, {
			Number: 4,
			Text:   "เป็นประจำ",
			Value:  3,
		},
	}

	// create set of test
	MockTestStress = []models.Test{
		{
			Number:       1,
			QuestionText: "นอนไม่หลับเพราะคิดมากหรือกังวลใจ",
			Choices:      allChoice,
		},
		{
			Number:       2,
			QuestionText: "รู้สึกหงุดหงิด รำคาญใจ",
			Choices:      allChoice,
		},
		{
			Number:       3,
			QuestionText: "ทำอะไรไม่ได้เลยเพราะประสาทตึงเครียด",
			Choices:      allChoice,
		},
		{
			Number:       4,
			QuestionText: "มีความวุ่นวายใจ",
			Choices:      allChoice,
		},
		{
			Number:       5,
			QuestionText: "ไม่อยากพบปะผู้คน",
			Choices:      allChoice,
		},
		{
			Number:       6,
			QuestionText: "ปวดหัวข้างเดียว หรือปวดบริเวณขมับทั้ง 2 ข้าง",
			Choices:      allChoice,
		},
		{
			Number:       7,
			QuestionText: "รู้สึกไม่มีความสุขและเศร้าหมอง",
			Choices:      allChoice,
		},
		{
			Number:       8,
			QuestionText: "รู้สึกหมดหวังในชีวิต",
			Choices:      allChoice,
		},
		{
			Number:       9,
			QuestionText: "รู้สึกชีวิตตนเองไม่มีคุณค่า",
			Choices:      allChoice,
		},
		{
			Number:       10,
			QuestionText: "กระวนกระวายอยู่ตลอดเวลา",
			Choices:      allChoice,
		},
		{
			Number:       11,
			QuestionText: "รู้สึกว่าตนเองไม่มีสมาธิ",
			Choices:      allChoice,
		},
		{
			Number:       12,
			QuestionText: "รู้สึกเพลียจนไม่มีแรงจะทำอะไร",
			Choices:      allChoice,
		},
		{
			Number:       13,
			QuestionText: "รู้สึกเหนื่อยหน่ายไม่อยากทำอะไร",
			Choices:      allChoice,
		},
		{
			Number:       14,
			QuestionText: "มีอาการหัวใจเต้นแรง",
			Choices:      allChoice,
		},
		{
			Number:       15,
			QuestionText: "เสียงสั่น ปากสั่น หรือมือสั่นเวลาไม่พอใจ",
			Choices:      allChoice,
		},
		{
			Number:       16,
			QuestionText: "รู้สึกกลัวผิดพลาดในการทำสิ่งต่าง ๆ",
			Choices:      allChoice,
		},
		{
			Number:       17,
			QuestionText: "ปวดหรือเกร็งกล้ามเนื้อบริเวณท้ายทอย หลัง หรือไหล่",
			Choices:      allChoice,
		},
		{
			Number:       18,
			QuestionText: "ตื่นเต้นง่ายกับเหตุการณ์ที่ไม่คุ้นเคย",
			Choices:      allChoice,
		},
		{
			Number:       19,
			QuestionText: "มึนงงหรือเวียนศีรษะ",
			Choices:      allChoice,
		},
		{
			Number:       20,
			QuestionText: "ความสุขทางเพศลดลง",
			Choices:      allChoice,
		},
	}

	// create set of test
	MockTestConsult = []models.Test{
		{
			Number:       1,
			QuestionText: "การที่จะเข้าใจผู้อื่นได้อย่างแท้จริง ควรตั้งต้นด้วยสิ่งใด",
			Choices: [4]models.Choice{
				{
					Number: 1,
					Text:   "ความต้องการและเจตนาที่อยากจะเข้าใจเขา",
					Value:  1,
				},
				{
					Number: 2,
					Text:   "อยากรู้อยากเห็น",
					Value:  0,
				},
				{
					Number: 3,
					Text:   "อยากทดสอบความรู้ตัวเอง",
					Value:  0,
				}, {
					Number: 4,
					Text:   "ไม่จําเป็นต้องตั้งต้นด้วยสิ่งใดเลย",
					Value:  0,
				},
			},
		},
		{
			Number:       2,
			QuestionText: "กรณีที่เรามีอารมณ์ร่วมกับผู้ระบายจนไม่สามารถให้คำแนะนำได้ควรทำอย่างไร",
			Choices: [4]models.Choice{
				{
					Number: 1,
					Text:   "ส่งต่อเรื่องราวนี้ให้ผู้อื่นรับช่วงต่อ",
					Value:  1,
				},
				{
					Number: 2,
					Text:   "ปล่อยให้ตัวเองจมดิ่งกับความรู้สึกนั้นและแสดงความรู้สึกนั้นออกไปให้ผู้ระบายรับรู้",
					Value:  0,
				},
				{
					Number: 3,
					Text:   "ฝันรับฟังต่อไปเรื่อยๆ",
					Value:  0,
				}, {
					Number: 4,
					Text:   "ไม่มีข้อใดถูก",
					Value:  0,
				},
			},
		},
		{
			Number:       3,
			QuestionText: "ถ้าคนมาระบายบอกว่า เขาเกิดความคิดที่ว่าคนนั่งหลังห้องคือคนไม่ตั้งใจเรียน อคติของเขาที่ เกิดขึ้นเกิดจากอะไร",
			Choices: [4]models.Choice{
				{
					Number: 1,
					Text:   "เกิดจากการมองแค่รูปลักษณ์ภายนอก",
					Value:  1,
				},
				{
					Number: 2,
					Text:   "เกิดจากการที่เรามองเห็นแต่ข้อบกพร่องของคนอื่น",
					Value:  0,
				},
				{
					Number: 3,
					Text:   "เกิดจากการตัดสินแบบเป็นกลุ่มมากกว่าตัวบุคคล",
					Value:  1,
				}, {
					Number: 4,
					Text:   "เกิดจากระบบอัตโนมัติของตัวเองเพราะไม่อยากแตกแยก",
					Value:  0,
				},
			},
		},
		{
			Number:       4,
			QuestionText: "สิ่งที่ควรระวังในการตั้งคำถาม มีอะไรบ้าง",
			Choices: [4]models.Choice{
				{
					Number: 1,
					Text:   "การตั้งคำถามชี้นำ",
					Value:  0,
				},
				{
					Number: 2,
					Text:   "การตั้งคำถามปลายปิด",
					Value:  0,
				},
				{
					Number: 3,
					Text:   "การตั้งคำถามปลายเปิด",
					Value:  0,
				}, {
					Number: 4,
					Text:   "ถูกทั้ง ก.และข",
					Value:  1,
				},
			},
		},
		{
			Number:       5,
			QuestionText: "เราต้องรู้สีกผิดหรือไม่ถ้าต้องส่งต่อเรื่องราวที่เรารับฟังไม่ไหวให้กับคนอื่น",
			Choices: [4]models.Choice{
				{
					Number: 1,
					Text:   "ไม่ต้องรู้สึกผิด เพราะจะดีกว่าที่เราจะส่งต่อและหาทางเลือกให้เขาไปเจอทางเลือกที่ดีกว่า",
					Value:  1,
				},
				{
					Number: 2,
					Text:   "ไม่ต้องรู้สึกผิด เพราะเราไม่จําเป็นต้องมีความรู้สึกอะไรให้เขาอยู่แล้ว",
					Value:  0,
				},
				{
					Number: 3,
					Text:   "รู้สึกผิด เพราะเขาไว้ใจเราแล้วแต่เรากลับทําไม่ได้",
					Value:  0,
				}, {
					Number: 4,
					Text:   "รู้สึกผิดและโทษตัวเองว่าเราไม่มีศักยภาพมากพอที่จะช่วยเขาได้",
					Value:  0,
				},
			},
		},
		{
			Number:       6,
			QuestionText: "การถามด้วยคำถามปลายเปิดดีอย่างไร",
			Choices: [4]models.Choice{
				{
					Number: 1,
					Text:   "เพื่อให้เขาลืมสิ่งที่เขากำลังทุกข์ใจ",
					Value:  0,
				},
				{
					Number: 2,
					Text:   "จะได้เจาะจงให้เขาตอบในแบบที่เราต้องการ",
					Value:  0,
				},
				{
					Number: 3,
					Text:   "รู้สึกผิด เพราะเขาไว้ใจเราแล้วแต่เรากลับทําไม่ได้",
					Value:  0,
				}, {
					Number: 4,
					Text:   "รู้สึกผิดและโทษตัวเองว่าเราไม่มีศักยภาพมากพอที่จะช่วยเขาได้",
					Value:  1,
				},
			},
		},
		{
			Number:       7,
			QuestionText: "จัดการตัวเองอย่างไร ในวันที่รับฟังผู้อื่นจนจัดการอารมณ์ตัวเองไม่ได้",
			Choices: [4]models.Choice{
				{
					Number: 1,
					Text:   "ทําความเข้าใจกับตัวเองว่านั่นคือปัญหาที่เราต้องแก้ให้เขา",
					Value:  0,
				},
				{
					Number: 2,
					Text:   "บอกตัวเองว่า เรามีหน้าที่รับฟังสำรวจปัญหาและช่วยให้เขาจัดการปัญหาด้วยตัวเขาเอง",
					Value:  1,
				},
				{
					Number: 3,
					Text:   "เก็บเรื่องราวของผู้อื่นมาคิดเมื่อจบบทสนทนาและน่ามาเป็นปัญหาของเรา",
					Value:  0,
				}, {
					Number: 4,
					Text:   "ถูกทุกข้อ",
					Value:  0,
				},
			},
		},
		{
			Number:       8,
			QuestionText: "การเข้าใจคนอื่นจำเป็นที่จะต้องปล่อยวางตัวตนของเราหรือไม่ เพราะอะไร",
			Choices: [4]models.Choice{
				{
					Number: 1,
					Text:   "จําเป็น เพราะเราจะได้เข้าใจมุมมองของเขามากขึ้น",
					Value:  0,
				},
				{
					Number: 2,
					Text:   "จําเป็น เพราะประสบการณ์, ความคิดและอารมณ์เรามันก็เป็นของเรา",
					Value:  0,
				},
				{
					Number: 3,
					Text:   "ไม่จําเป็น เพราะเขาเลือกที่จะปรึกษาเรา ต้องยอมรับในตัวเราให้ได้",
					Value:  0,
				}, {
					Number: 4,
					Text:   "ถูกทั้ง ก.และข.",
					Value:  1,
				},
			},
		},
		{
			Number:       9,
			QuestionText: "เราสามารถเอาไม้บรรทัดของตัวเราเองไปวัดคนอื่นได้หรือไม่ เพราะอะไร",
			Choices: [4]models.Choice{
				{
					Number: 1,
					Text:   "ไม่ได้ เพราะตัวเรานั้นแย่เกินกว่าจะไปเปรียบเทียบกับใคร",
					Value:  0,
				},
				{
					Number: 2,
					Text:   "ไม่ได้ เพราะเรื่องบางเรื่องไม่ได้ถูกต้องหรือผิด100%",
					Value:  1,
				},
				{
					Number: 3,
					Text:   "ได้ เพราะมันคือความเป็นจริงที่เขาต้องยอมรับให้ได้",
					Value:  0,
				}, {
					Number: 4,
					Text:   "ถูกทั้ง ก.และข.",
					Value:  0,
				},
			},
		},
		{
			Number:       10,
			QuestionText: "คำถามประเภทใดควรหลีกเลี่ยงในการสนทนา เพราะอะไร",
			Choices: [4]models.Choice{
				{
					Number: 1,
					Text:   "คำถามปลายปิด เพราะมีคำตอบให้เลือก อาจจะดูเหมือนเราไปตัดสินเขา",
					Value:  1,
				},
				{
					Number: 2,
					Text:   "คำถามปลายเปิด เพราะผู้สนทนาจะได้ทบทวนตัวเองไปด้วย",
					Value:  1,
				},
				{
					Number: 3,
					Text:   "ถูกทั้งข้อสองข้อ",
					Value:  0,
				}, {
					Number: 4,
					Text:   "ไม่มีข้อใดถูก",
					Value:  0,
				},
			},
		},
		{
			Number:       11,
			QuestionText: "อะไรคือหัวใจหลักของการเข้าอกเข้าใจผู้อื่น",
			Choices: [4]models.Choice{
				{
					Number: 1,
					Text:   "ละความเป็นตัวเองลง",
					Value:  0,
				},
				{
					Number: 2,
					Text:   "การคิดแทน",
					Value:  0,
				},
				{
					Number: 3,
					Text:   "ความอยากรู้อยากเห็น",
					Value:  0,
				}, {
					Number: 4,
					Text:   "ถูกทุกช้อ",
					Value:  1,
				},
			},
		},
		{
			Number:       12,
			QuestionText: "เคล็ดลับสำคัญของการปลอบใจผ่านข้อความจากเทคนิคของนักจิตวิทยาคืออะไร",
			Choices: [4]models.Choice{
				{
					Number: 1,
					Text:   "อ่านข้อความอย่างละเอียดและกลั่นกรองคำพูด",
					Value:  1,
				},
				{
					Number: 2,
					Text:   "ไม่จําเป็นต้องเข้าใจเขาแค่รับฟังเขาก็พอ",
					Value:  0,
				},
				{
					Number: 3,
					Text:   "เลือกคำพูดที่ดูเป็นทางการ",
					Value:  0,
				}, {
					Number: 4,
					Text:   "ไม่มีข้อใดถูก",
					Value:  0,
				},
			},
		},
		{
			Number:       13,
			QuestionText: "เราไม่ควรตัดสินคนอื่นว่า ผิดถูก ดี ไม่ดี,เหมาะสมไม่เหมาะสม เพราะอะไร",
			Choices: [4]models.Choice{
				{
					Number: 1,
					Text:   "เพราะเราไม่มีศักยภาพมากพอ",
					Value:  1,
				},
				{
					Number: 2,
					Text:   "เพราะเราก็เป็นคนไม่ดีเหมือนกัน",
					Value:  0,
				},
				{
					Number: 3,
					Text:   "เพราะตัวเราเองไม่ได้ไปยืนในจุดที่เป็นปัญหาของเขาจริงๆ",
					Value:  0,
				}, {
					Number: 4,
					Text:   "ไม่มีข้อใดถู",
					Value:  0,
				},
			},
		},
		{
			Number:       14,
			QuestionText: "ถ้าเพื่อนมาปรึกษาเราแล้วเราแสดงความคิดเห็นออกไป แต่เพื่อนเลือกที่จะตัดสินใจแบบ เพื่อน ควรทำอย่างไร",
			Choices: [4]models.Choice{
				{
					Number: 1,
					Text:   "แย้งเพื่อนและบอกว่าความคิดเห็นของเราสมเหตุสมผลกว่า",
					Value:  1,
				},
				{
					Number: 2,
					Text:   "อยู่ข้างๆเพื่อน เคารพการตัดสินใจของเพื่อน",
					Value:  1,
				},
				{
					Number: 3,
					Text:   "อยู่ข้างๆเพื่อน บอกเพื่อนว่าข้อคิดเห็นของเราดูเป็นไปได้กว่า",
					Value:  0,
				}, {
					Number: 4,
					Text:   "ไม่คุยกับเพื่อนคนนี้อีกเพราะเขาไม่เชื่อเรา",
					Value:  0,
				},
			},
		},
		{
			Number:       14,
			QuestionText: "การยอมรับความช่วยเหลือในวันที่ไม่ไหวจริงๆ ผิดหรือไม่",
			Choices: [4]models.Choice{
				{
					Number: 1,
					Text:   "ผิด เพราะเป็นการแสดงออกถึงความอ่อนแอ",
					Value:  1,
				},
				{
					Number: 2,
					Text:   "ผิด เพราะไม่มีใครที่จะเต็มใจช่วยและจริงใจกับเราจริงๆ",
					Value:  1,
				},
				{
					Number: 3,
					Text:   "ไม่ผิด หากไม่สามารถผ่านเรื่องนั้นได้ด้วยตัวคนเดียว",
					Value:  1,
				}, {
					Number: 4,
					Text:   "ไม่ผิด เพราะเราใจไม่สู้เอง",
					Value:  0,
				},
			},
		},
		{
			Number:       15,
			QuestionText: "การยอมรับความช่วยเหลือในวันที่ไม่ไหวจริงๆ ผิดหรือไม่",
			Choices: [4]models.Choice{
				{
					Number: 1,
					Text:   "ผิด เพราะเป็นการแสดงออกถึงความอ่อนแอ",
					Value:  1,
				},
				{
					Number: 2,
					Text:   "ผิด เพราะไม่มีใครที่จะเต็มใจช่วยและจริงใจกับเราจริงๆ",
					Value:  1,
				},
				{
					Number: 3,
					Text:   "ไม่ผิด หากไม่สามารถผ่านเรื่องนั้นได้ด้วยตัวคนเดียว",
					Value:  1,
				}, {
					Number: 4,
					Text:   "ไม่ผิด เพราะเราใจไม่สู้เอง",
					Value:  0,
				},
			},
		},
		{
			Number:       16,
			QuestionText: "หลังจากที่เราอ่านข้อความของเขาอย่างละเอียดถี่ถ้วนแล้ว ก่อนที่จะตอบหรือให้กำลังใจเขา ควรทำสิ่งใดก่อน",
			Choices: [4]models.Choice{
				{
					Number: 1,
					Text:   "ตัดสินทันทีว่าเรื่องราวของเขาเป็นอย่างไร ถูก-ไม่ถูก,ดี-ไม่ดี",
					Value:  0,
				},
				{
					Number: 2,
					Text:   "ไตร่ตรองและทบทวนจากใจของเราจริง ๆ ก่อนที่จะตอบเขาไป",
					Value:  1,
				},
				{
					Number: 3,
					Text:   "คิดทบทวนถึงเรื่องราวของตนเองว่าเคยมีประสบการณ์แบบนี้มาก่อนหรือไม่",
					Value:  0,
				}, {
					Number: 4,
					Text:   "เปรียบเทียบเรื่องราวของเขากับเรื่องราวของคนอื่น",
					Value:  0,
				},
			},
		},
		{
			Number:       17,
			QuestionText: "เราจะรับมืออย่างไรกับคำถามสุดโหด",
			Choices: [4]models.Choice{
				{
					Number: 1,
					Text:   "ตั้งคำถามเพื่อให้เกิดความคิดทบทวนและสํารวจไปด้วย'",
					Value:  1,
				},
				{
					Number: 2,
					Text:   "ปล่อยให้ตัวเองจมดิ่งไปกับมัน'",
					Value:  0,
				},
				{
					Number: 3,
					Text:   "แสดงความคิดเห็นของตัวเองออกไปอย่างเต็มที่",
					Value:  0,
				}, {
					Number: 4,
					Text:   "เปรียบเทียบตัวเขากับคนอื่นที่เจอสถานการณ์คล้ายกัน",
					Value:  0,
				},
			},
		},
		{
			Number:       18,
			QuestionText: "การทวนใจความสําคัญของผู้พูด มีความสำคัญอย่างไร",
			Choices: [4]models.Choice{
				{
					Number: 1,
					Text:   "เพื่อให้ตัวผู้รับฟังและผู้พูดออกนอกประเด็นตึงเครียด'",
					Value:  0,
				},
				{
					Number: 2,
					Text:   "เพื่อให้ผู้รับฟังรู้สึกว่าเราตอกย้ำเรื่องราวและความเจ็บปวดของเขา'",
					Value:  0,
				},
				{
					Number: 3,
					Text:   "เพื่อย้ำความคิดว่าทั้งผู้รับฟังและผู้พูดเข้าใจตรงกัน",
					Value:  0,
				}, {
					Number: 4,
					Text:   "หากปัญหาที่กำลังรับฟัง เป็นปัญหาเดียวกันกับที่เราเผชิญอยู่ เราจะแยกความรู้สึกของตัวเอง ออกจากเรื่องที่รับฟังอย่างไร",
					Value:  1,
				},
			},
		},
		{
			Number:       19,
			QuestionText: "หากปัญหาที่กำลังรับฟัง เป็นปัญหาเดียวกันกับที่เราเผชิญอยู่ เราจะแยกความรู้สึกของตัวเอง ออกจากเรื่องที่รับฟังอย่างไร",
			Choices: [4]models.Choice{
				{
					Number: 1,
					Text:   "ไม่จําเป็นต้องแยกเรื่องตัวเองออกมาเพราะถือว่าเรามีประสบการณ์'",
					Value:  0,
				},
				{
					Number: 2,
					Text:   "ทําความเข้าใจกับสถานการณ์และปัญหาของผู้ระบาย'",
					Value:  1,
				},
				{
					Number: 3,
					Text:   "พยายามเปรียบเทียบปัญหาของเราและปัญหาของผู้ระบาย",
					Value:  0,
				}, {
					Number: 4,
					Text:   "ถูกทุกช้อ",
					Value:  0,
				},
			},
		},
		{
			Number:       20,
			QuestionText: "การตั้งคำถามปลายเปิดจะส่งผลอย่างไรต่อตัวผู้ระบาย",
			Choices: [4]models.Choice{
				{
					Number: 1,
					Text:   "ช่วยให้ผู้ระบายได้สารวจตัวเองและได้ทบทวนตัวเอง'",
					Value:  1,
				},
				{
					Number: 2,
					Text:   "เหมือนเป็นการตัดสินว่าเขาผิด-ถูก,ดี-ไม่ดี'",
					Value:  0,
				},
				{
					Number: 3,
					Text:   "ทําให้เขาอึดอัด",
					Value:  0,
				}, {
					Number: 4,
					Text:   "ทําให้พูดระบายรู้สึกว่าเราซักใช้เขาเกินไป",
					Value:  0,
				},
			},
		},
	}

}
